---
kind: type
id: T:Autodesk.Revit.UI.Events.ExecutedEventArgs
source: html/701d2fb4-1402-e2f7-6e09-d4cb955ee7da.htm
---
# Autodesk.Revit.UI.Events.ExecutedEventArgs

The event arguments used by AddInCommandBinding's Executed event.

## Syntax (C#)
```csharp
public class ExecutedEventArgs : CommandEventArgs
```